/*
1.Έστω ένα πρόγραμμα σε C στην αρχή του οποίου δίνονται οι εξής εντολές:
pid1=fork();  
if (pid1!=0) { 
     pid2=fork(); 
     pid3=fork();
     }
else { 
    pid4=fork(); 
    if (pid4==0) { 
        pid5=fork(); 
        } 
    }
...............................
Πόσες διεργασίες παράχθηκαν με τις προηγούμενες εντολές; Ποια είναι η «συγγένεια» μεταξύ τους; Εξηγείστε
συνοπτικά πως παρήχθησαν οι ανωτέρω διεργασίες (βήμα/εντολή προς βήμα/εντολή, με ποιο fork δημιουργήθηκε η
κάθε μία / ποιο pid αντιστοιχεί σε κάθε μία κλπ). Δώστε επίσης ένα σχήμα στο οποίο θα φαίνεται με σαφή τρόπο η
ιεραρχία μεταξύ των ανωτέρω διεργασιών. 

Απάντηση :
Στο παραπάνω πρόγραμμα, πριν εκτελεσθεί οποιαδήποτε fork(), τρέχει ήδη μια διεργασία, ας την ονομάσουμε διεργασία parent.  
Έπειτα, εκτελείται η εντολή pid1 = fork();, δηλαδή πραγματοποιείται η δημιουργία μιας νέας διεργασίας, ας την ονομάσουμε p1.
Το πρώτο if case (if (pid1!=0)) ελέγχει την περίπτωση που η διεργασία p1 που δημιουργήθηκε επιστρέφει κάποια τιμή διάφορη του 0, δηλάδη
την περίπτωση η διεργασία αυτή δεν είναι παιδί της parent. Αξίζει να σημειωθεί αν επιστραφεί η τιμή -1, δηλάδη η περίπτωση όπου υπάρξει σφάλμα, ακολουθεί 
το ίδιο if case, όποτε δεν ελέγχονται όλα τα corner cases.

Στο πρώτο if case, ελέγχουμε λοιπόν αν η διεργασία p1 δεν είναι παιδί. Αν ισχυεί αυτό, τότε δημιουργείται μια διεργασία με την εντολή pi2 = fork(), ας την ονομάσουμε p2
και η p2 δημιουργεί μια ακόμη την p3 απο το pid3 = fork(). Όμως απο την φύση της, η fork() δημιουργεί μια διεργασία-παιδί και η γονική της διεργασία κάνει
ό,τι κάνει και η διεργασία-παιδί. Επομένως, η parent διεργασία θα δημιουργήσει μια διεργασία ακομή με όνομα p4 μιας και θα κάνει ό,τι έκανε και η διεργασία
p2 μιας και τρέχουν περίπου παράλληλα.

Στο else case ελέγχεται οτι το parent έχει παιδί με όνομα p1 απο το πρώτο fork(), επομένως οι διεργασίες που θα δημιουργηθούν τώρα αφορούν τη διεργασία p1 
και όχι την parent. Έπειτα, γίνεται ένα ακόμη fork() (pid4 = fork()) όπου δημιουργεί η p1 ένα παιδί με όνομα p5. 
Στο if statement ( if (pid4 ==0) ) ελέγχεται αν η διεργασία που δημιούργησε η p5 είναι παιδί της. Αν αυτό ισχυεί, τότε δημιουργείται μια τελευταία διεργασία
απο την εντολή pid5 = fork() και έτσι ολοκληρώνεται το δένδρο διεργασιών.

Η συγγένια μεταξύ τους είναι, το parent έχει παιδί το p1, εγγόνι το p5 και δισέγγονο το p6.
Επίσης το parent έχει παδί τη p2 και εγγόνι την p3.
Τέλος, η parent έχει παιδί την p4.
Συνολικά τρέχουν 7 διεργασίες.




*/
